{"config": {"layers": [{"config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [5, 5], "bias_constraint": null, "name": "conv2d_1", "batch_input_shape": [null, 48, 48, 1], "padding": "same", "filters": 96, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null, "trainable": true, "name": "batch_normalization_1", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "rate": 0.25, "noise_shape": null, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [2, 2], "bias_constraint": null, "name": "conv2d_2", "padding": "same", "filters": 256, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null, "trainable": true, "name": "batch_normalization_2", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "rate": 0.25, "noise_shape": null, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_3", "padding": "same", "filters": 256, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null, "trainable": true, "name": "batch_normalization_3", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_3", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "rate": 0.25, "noise_shape": null, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [2, 2], "bias_constraint": null, "name": "conv2d_4", "padding": "same", "filters": 384, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null, "trainable": true, "name": "batch_normalization_4", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"seed": null, "rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [2, 2], "bias_constraint": null, "name": "conv2d_5", "padding": "same", "filters": 384, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null, "trainable": true, "name": "batch_normalization_5", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"seed": null, "rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_size": [2, 2], "bias_constraint": null, "name": "conv2d_6", "padding": "same", "filters": 256, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null, "trainable": true, "name": "batch_normalization_6", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_4", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_6"}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "units": 1024, "name": "dense_1", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null, "trainable": true, "name": "batch_normalization_7", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "class_name": "Activation"}, {"config": {"seed": null, "rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_7"}, "class_name": "Dropout"}, {"config": {"use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "units": 512, "name": "dense_2", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null, "trainable": true, "name": "batch_normalization_8", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "class_name": "Activation"}, {"config": {"seed": null, "rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_8"}, "class_name": "Dropout"}, {"config": {"use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "units": 512, "name": "dense_3", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "gamma_constraint": null, "trainable": true, "name": "batch_normalization_9", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_9", "activation": "relu"}, "class_name": "Activation"}, {"config": {"seed": null, "rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_9"}, "class_name": "Dropout"}, {"config": {"use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null, "units": 7, "name": "dense_4", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "softmax"}, "class_name": "Dense"}], "name": "sequential_1"}, "backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential"}