{"config": {"name": "sequential_3", "layers": [{"config": {"trainable": true, "bias_regularizer": null, "data_format": "channels_last", "padding": "same", "filters": 64, "dtype": "float32", "dilation_rate": [1, 1], "name": "conv2d_9", "activity_regularizer": null, "activation": "linear", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "batch_input_shape": [null, 48, 48, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "batch_normalization_13", "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_13"}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_9"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_13", "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "dilation_rate": [1, 1], "name": "conv2d_10", "activity_regularizer": null, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "batch_normalization_14", "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_14"}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_10"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_14", "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 512, "dilation_rate": [1, 1], "name": "conv2d_11", "activity_regularizer": null, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "padding": "same", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "batch_normalization_15", "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_15"}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_11"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_15", "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 512, "dilation_rate": [1, 1], "name": "conv2d_12", "activity_regularizer": null, "activation": "linear", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "padding": "same", "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "batch_normalization_16", "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_16"}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_12"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_16", "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_3"}, "class_name": "Flatten"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 256, "name": "dense_7", "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "batch_normalization_17", "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_17"}, "class_name": "Activation"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_17", "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 512, "name": "dense_8", "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "name": "batch_normalization_18", "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_18"}, "class_name": "Activation"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_18", "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 7, "name": "dense_9", "activity_regularizer": null, "activation": "softmax", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}]}, "keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential"}