{"config": {"layers": [{"config": {"activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "kernel_size": [5, 5], "batch_input_shape": [null, 48, 48, 1], "name": "conv2d_41", "strides": [1, 1], "dtype": "float32", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "filters": 64, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "name": "batch_normalization_11", "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "center": true, "gamma_constraint": null, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "name": "p_re_lu_57"}, "class_name": "PReLU"}, {"config": {"padding": [[2, 2], [2, 2]], "trainable": true, "data_format": "channels_last", "name": "zero_padding2d_49"}, "class_name": "ZeroPadding2D"}, {"config": {"strides": [2, 2], "padding": "valid", "trainable": true, "pool_size": [5, 5], "data_format": "channels_last", "name": "max_pooling2d_9"}, "class_name": "MaxPooling2D"}, {"config": {"padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last", "name": "zero_padding2d_50"}, "class_name": "ZeroPadding2D"}, {"config": {"trainable": true, "name": "dropout_22", "seed": null, "rate": 0.5, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "bias_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_42", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 64, "trainable": true, "activity_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "name": "batch_normalization_12", "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "center": true, "gamma_constraint": null, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "name": "p_re_lu_58"}, "class_name": "PReLU"}, {"config": {"padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last", "name": "zero_padding2d_51"}, "class_name": "ZeroPadding2D"}, {"config": {"trainable": true, "name": "dropout_23", "seed": null, "rate": 0.5, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "bias_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_43", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 64, "trainable": true, "activity_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "name": "batch_normalization_13", "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "center": true, "gamma_constraint": null, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "name": "p_re_lu_59"}, "class_name": "PReLU"}, {"config": {"strides": [2, 2], "padding": "valid", "trainable": true, "pool_size": [3, 3], "data_format": "channels_last", "name": "average_pooling2d_17"}, "class_name": "AveragePooling2D"}, {"config": {"padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last", "name": "zero_padding2d_52"}, "class_name": "ZeroPadding2D"}, {"config": {"trainable": true, "name": "dropout_24", "seed": null, "rate": 0.5, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "bias_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_44", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 128, "trainable": true, "activity_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "name": "batch_normalization_14", "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "center": true, "gamma_constraint": null, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "name": "p_re_lu_60"}, "class_name": "PReLU"}, {"config": {"padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last", "name": "zero_padding2d_53"}, "class_name": "ZeroPadding2D"}, {"config": {"trainable": true, "name": "dropout_25", "seed": null, "rate": 0.5, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activation": "linear", "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "valid", "bias_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "name": "conv2d_45", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 128, "trainable": true, "activity_regularizer": null, "use_bias": true, "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"epsilon": 0.001, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "name": "batch_normalization_15", "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "center": true, "gamma_constraint": null, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "name": "p_re_lu_61"}, "class_name": "PReLU"}, {"config": {"padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_last", "name": "zero_padding2d_54"}, "class_name": "ZeroPadding2D"}, {"config": {"strides": [2, 2], "padding": "valid", "trainable": true, "pool_size": [3, 3], "data_format": "channels_last", "name": "average_pooling2d_18"}, "class_name": "AveragePooling2D"}, {"config": {"trainable": true, "name": "dropout_26", "seed": null, "rate": 0.5, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_9"}, "class_name": "Flatten"}, {"config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 1024, "bias_constraint": null, "name": "dense_25", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "name": "p_re_lu_62"}, "class_name": "PReLU"}, {"config": {"trainable": true, "name": "dropout_27", "seed": null, "rate": 0.5, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 1024, "bias_constraint": null, "name": "dense_26", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": null, "alpha_initializer": {"config": {}, "class_name": "Zeros"}, "name": "p_re_lu_63"}, "class_name": "PReLU"}, {"config": {"trainable": true, "name": "dropout_28", "seed": null, "rate": 0.5, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activation": "linear", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "units": 7, "bias_constraint": null, "name": "dense_27", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_9", "activation": "softmax"}, "class_name": "Activation"}], "name": "sequential_9"}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4"}