{"keras_version": "2.2.4", "class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "dtype": "float32", "bias_regularizer": null, "name": "block1_conv1", "activation": "relu", "filters": 64, "batch_input_shape": [null, 48, 48, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "strides": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_1", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_3", "trainable": true, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "name": "block1_conv2", "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "block1_pool", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_4", "trainable": true, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "name": "block2_conv1", "filters": 128, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_3", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_5", "trainable": true, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "name": "block2_conv2", "filters": 128, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_4", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "block2_pool", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_6", "trainable": true, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "name": "block3_conv1", "filters": 256, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_7", "trainable": true, "noise_shape": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_5", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "name": "block3_conv2", "filters": 256, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_8", "trainable": true, "noise_shape": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_6", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "name": "block3_conv3", "filters": 256, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_9", "trainable": true, "noise_shape": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_7", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "name": "block3_conv4", "filters": 256, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.2, "seed": null, "name": "dropout_10", "trainable": true, "noise_shape": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_8", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "block3_pool", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_11", "trainable": true, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "name": "block4_conv1", "filters": 512, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_12", "trainable": true, "noise_shape": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_9", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "name": "block4_conv2", "filters": 512, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_13", "trainable": true, "noise_shape": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_10", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "name": "block4_conv3", "filters": 512, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_14", "trainable": true, "noise_shape": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_11", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "name": "block4_conv4", "filters": 512, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "block4_pool", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_15", "trainable": true, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "name": "block5_conv1", "filters": 512, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_16", "trainable": true, "noise_shape": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_12", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "name": "block5_conv2", "filters": 512, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_17", "trainable": true, "noise_shape": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_13", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "name": "block5_conv3", "filters": 512, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_18", "trainable": true, "noise_shape": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_14", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_size": [3, 3], "padding": "same", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "activity_regularizer": null, "name": "block5_conv4", "filters": 512, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activation": "relu", "trainable": true, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_19", "trainable": true, "noise_shape": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99, "center": true, "gamma_constraint": null, "axis": -1, "name": "batch_normalization_15", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "block5_pool", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_20", "trainable": true, "noise_shape": null}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "name": "fc1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "relu", "units": 4096, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "trainable": true, "use_bias": true}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_21", "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "name": "fc2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "relu", "units": 4096, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "trainable": true, "use_bias": true}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "name": "dropout_22", "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "name": "predictions", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "softmax", "units": 7, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "trainable": true, "use_bias": true}}], "name": "sequential_2"}}